IDEA Open Model
CrossSectionFactory.FillShapeL Method
Compatible with IDEA StatiCa Beta 20.0
 Creates a new L shape css - massive concrete shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public static void FillShapeL(
	CrossSectionParameter css,
	double h,
	double b,
	double th,
	double sh
)
Public Shared Sub FillShapeL (
	css As CrossSectionParameter,
	h As Double,
	b As Double,
	th As Double,
	sh As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
h
Type: System.Double
The height of css.
b
Type: System.Double
The width of css.
th
Type: System.Double
The bottom flange thisckness.
sh
Type: System.Double
The wall thickness.
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace